### **Задача 1 (обязательная)**
Напишите программу, запуск которой выводит ваше имя и фамилию латиницей.

Пример работы программы:

*Voronov Filipp*

### **Задача 2 (необязательная)**
??*ВНИМАНИЕ* эта задача делается на основе предыдущей и в том же реплите, т.е. в итоге вы присылаете только одну ссылку на две задачи. Зачёт по этой будет означать автоматический зачёт по предыдущей.

Пусть теперь до вывода сообщения будут четыре переменные:

переменная String name, заполненная вашим именем;
переменная String surname, заполненная вашей фамилией;
переменная ??? income, заполненная величиной (ненастоящего) месячного дохода;
переменная ??? spending, заполненная величиной (ненастоящего) месячного расхода.
После объявления этих трёх заполненных переменных вам надо одной командой System.out.println вывести составное сообщение вида:

*Voronov Filipp, surplus: -13540 руб*

где месячный остаток (surplus) это разница между доходами и расходами.

Подказки
Соберите итоговый текст через +: System.out.println(name + " " + surname + ", месячный остаток: " + ...);